In [18]:
import pandas as pd

data={'Name': ['John', 'Anna', 'Peter'],'Age': [28, 24, 35],'City': ['New York', 'Paris', 'Berlin']}
df=pd.DataFrame(data)
print(df)
json_data=df.to_json(orient='records')
print(json_data)

    Name  Age      City
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
[{"Name":"John","Age":28,"City":"New York"},{"Name":"Anna","Age":24,"City":"Paris"},{"Name":"Peter","Age":35,"City":"Berlin"}]

In [1]:
fs = frozenset([1, 2, 3, 4])
print(fs)
# Set operations
fs2 = frozenset([3, 4, 5])
print(fs.union(fs2))       # Output: frozenset({1, 2, 3, 4, 5})
print(fs.intersection(fs2))# Output: frozenset({3, 4})

# Trying to modify it (will raise an error)
# fs.add(6)

frozenset({1, 2, 3, 4})
frozenset({1, 2, 3, 4, 5})
frozenset({3, 4})

In [3]:
l = ["Geeks", "for", "Geeks"]
frozenset_l=frozenset(l)
print(frozenset_l)

frozenset({'Geeks', 'for'})

In [10]:
def count_up_to(n):
    i = 1
    while i <= n:
        yield i
        i += 1

gen = count_up_to(3)
print(next(gen)) 
print(next(gen))
print(next(gen))

1
2
3

In [17]:

gen = count_up_to(1000)

mid_value = None
for i, val in enumerate(gen, start=1):
    if i == 500:
        mid_value = val
        break

print(mid_value)  # Output: 500

def count_up_to(n):
    i = 1
    while i <= n:
        yield i      # ðŸ‘ˆ This is where `yield` is used
        i += 1

500

In [3]:
import io
from contextlib import redirect_stdout

def my_decorator(func):
    def wrapper():
        f = io.StringIO()
        with redirect_stdout(f):
            func()
        output = f.getvalue().upper()
        print("before calling")
        print(output, end="")  # avoid double newlines
        print("after")
    return wrapper

@my_decorator
def test():
    print("Hello")

test()

before calling
HELLO
after

In [8]:
import copy


original_list=[[1, 2], [3, 4]]
shallow=copy.copy(original_list)
shallow[0][0]=99
print(shallow) 
print(original_list)

[[99, 2], [3, 4]]
[[99, 2], [3, 4]]

In [12]:
original_list=[[1, 2], [3, 4]]
deep=copy.deepcopy(original_list)
deep[0][0]=100
print(deep)
print(original_list)

[[100, 2], [3, 4]]
[[1, 2], [3, 4]]

In [1]:
from collections import Counter
# Create a Counter object
my_counter = Counter(['apple', 'banana', 'orange', 'apple', 'banana', 'banana'])
count=Counter(my_counter)
print(count)

Counter({'banana': 3, 'apple': 2, 'orange': 1})

In [6]:
import pandas as pd

df1= pd.DataFrame({'Id': [1, 2, 3], 'Name': ['John', 'Anna', 'Peter']})
df2= pd.DataFrame({'Id': [2, 3, 4], 'Name': ['Anna', 'Peter', 'Linda']})
pd.merge(df1, df2, how='outer', on='Id')

   Id Name_x Name_y
0   1   John    NaN
1   2   Anna   Anna
2   3  Peter  Peter
3   4    NaN  Linda

In [19]:

df1 = pd.DataFrame({'Id': [1, 2, 3], 'Name': ['John', 'Anna', 'Peter']})
df2 = pd.DataFrame({'Id': [2, 3, 4], 'Name': ['Anna', 'Peter', 'Linda']})

df3 = pd.merge(df1, df2, on='Id', how='right', suffixes=('_df1', '_df2'))
print(df3)

   Id Name_df1 Name_df2
0   2     Anna     Anna
1   3    Peter    Peter
2   4      NaN    Linda

In [20]:
pd.concat([df1, df2], axis=0, ignore_index=True)

   Id   Name
0   1   John
1   2   Anna
2   3  Peter
3   2   Anna
4   3  Peter
5   4  Linda

In [29]:
df = pd.DataFrame({
    'Name': ['John', 'Anna', None],
    'Age': [28, None, 35]
})
print(df.isnull().sum().sum())
print(df.dropna())

2
   Name   Age
0  John  28.0

In [30]:
import pandas as pd
data = {
    'City': ['New York', 'Los Angeles', 'Chicago', 'New York', 'Chicago', 'Los Angeles'],
    'Age': [20, 20, 30, 20, 30, 20],
    'Salary': [70000, 80000, 100000, 90000, 120000, 95000]
}

# Create the DataFrame
df = pd.DataFrame(data)

# Grouping by City and Age, then summing the Salary
df_grouped = df.groupby(['City', 'Age'])['Salary'].sum().reset_index()

# Display the result
print(df_grouped)

          City  Age  Salary
0      Chicago   30  220000
1  Los Angeles   20  175000
2     New York   20  160000

In [14]:
import pandas as pd
import random
from datetime import datetime, timedelta
n = 2000000
names = ['Alice', 'Bob', 'Charlie', 'Diana']
cities = ['New York', 'Delhi', 'London', 'Berlin']
statuses = ['Pending', 'Shipped', 'Delivered', 'Returned']
start_date = datetime(2024, 1, 1)
dates = [start_date + timedelta(days=random.randint(0, 365)) for _ in range(n)]
df = pd.DataFrame({
    'id':pd.Series(range(1,n+1)),
    'name':pd.Series(random.choices(names, k=n)),
    'city': pd.Series(random.choices(cities, k=n)),
    'status': pd.Series(random.choices(statuses, k=n)),
    'amount': pd.Series([random.randint(100, 10000) for _ in range(n)]),
    'order_date': pd.Series(dates)
})
# print(df.tail(10))
##need on random index
# df_subset = df.iloc[101:106]  
# print("Index:",df_subset.index)

In [15]:
# df_index.loc['Alice','id']=1000
import os

##break into multiple files
# df = pd.DataFrame({'col1': range(2_000_000), 'col2': range(2_000_000)})

# Split
rows_per_sheet = 1_000_000
num_sheets = len(df) // rows_per_sheet + (1 if len(df) % rows_per_sheet > 0 else 0)

# Get desktop path
desktop = os.path.join(os.path.expanduser("~"), "Desktop")
file_path = os.path.join(desktop, "details.xlsx")

# Save the original DataFrame split across sheets
with pd.ExcelWriter(file_path, engine='xlsxwriter') as writer:
    for i in range(num_sheets):
        start = i * rows_per_sheet
        end = start + rows_per_sheet
        df.iloc[start:end].to_excel(writer, sheet_name=f'Sheet{i+1}', index=False)

print(f"Saved Excel file with {num_sheets} sheets to: {file_path}")

Saved Excel file with 2 sheets to: /Users/aryanpatel/Desktop/details.xlsx

In [ ]:
df.to_csv('output.csv', index=True)

In [117]:
import copy
n=[1,2,3,[4,5,6]]
n_copy=copy.copy(n)
n_copy[1]=99

In [102]:
n_copy[3][0]=50

In [103]:
print(n_copy)

[1, 99, 3, [50, 5, 6]]

In [105]:
print(n)

[1, 2, 3, [50, 5, 6]]

In [95]:
n_list=[1,2,3,[4,5,6]]
d_copy=copy.deepcopy(n_list)

In [27]:
import pandas as pd

data = [{'b': 2, 'c': 3}, {'a': 10, 'b': 20, 'c': 30}]

df=pd.DataFrame(data,columns=['a','b','c'],index=['1','2'])

In [29]:
original_df = pd.DataFrame({
    'Name': ['Tom', 'Nick', 'Krish', 'Jack'],
    'Age': [20, 21, 19, 18]
})

In [41]:
new_df=original_df[['Name']]

In [47]:
d = {'one': pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd']),
     'two': pd.Series([10, 20, 30, 40],index=['a', 'b', 'c', 'd'])}
df=pd.DataFrame(d)

In [61]:
Name = ['tom', 'krish', 'nick', 'juli']
Age=[20, 21, 19, 18]
list_of_tuples = list(zip(Name, Age))
df=pd.DataFrame(list_of_tuples,columns=['Name','Age'],index=['a','b','c','d'])

In [84]:
data = [1, 2, 3, 4, 5]
df=pd.DataFrame(data,columns=['Numbers'])

In [92]:
import pandas as pd

# data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv",index_col="Team")

# display(data.head())
# rows = data.loc["Utah Jazz"]

In [165]:

data = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie',"wddd"],
    'Age': [25, 30, 35,40],
    'City': ['NY', 'LA', 'SF','ee']
})
# n=data.set_index('Name', inplace=True)

In [175]:
data

      Name  Age City
0    Alice   25   NY
1      Bob   30   LA
2  Charlie   35   SF
3     wddd   40   ee

In [167]:
# retrieving rows by loc method 
# rows = data.loc["Alice": "Charlie"] 
loc_data=data.loc[1:3]

In [174]:
iloc_data=data.iloc[0,:]
iloc_data

Name    Alice
Age        25
City       NY
Name: 0, dtype: object

In [178]:
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv",index_col="Team")
print("Dataset")
display(data.head(5))

Dataset

,Name,Number,Position,Age,Height,Weight,College,Salary
Team,,,,,,,,
Boston Celtics,Avery Bradley,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Boston Celtics,Jae Crowder,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
Boston Celtics,John Holland,30.0,SG,27.0,6-5,205.0,Boston University,NaN
Boston Celtics,R.J. Hunter,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Boston Celtics,Jonas Jerebko,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [184]:
first = data["Age"]
display(first.head(5))

Team
Boston Celtics    25.0
Boston Celtics    25.0
Boston Celtics    27.0
Boston Celtics    22.0
Boston Celtics    29.0
Name: Age, dtype: float64

In [185]:
first=data[['Age','Name','Height']]

In [213]:
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv",index_col="Name")

In [ ]:
data.loc["R.J. Hunter"]

In [198]:
data.loc[["R.J. Hunter", "J.R. Smith"]]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
J.R. Smith,Cleveland Cavaliers,5.0,SG,30.0,6-6,225.0,NaN,5000000.0

In [200]:
#specific rows and coloums
data.loc[["R.J. Hunter", "J.R. Smith"], ["Team", "Height"]]

                            Team Height
Name
R.J. Hunter       Boston Celtics    6-5
J.R. Smith   Cleveland Cavaliers    6-6

In [207]:
#all rows and specific columns
data.loc[:,["Team", "Height"]]

                         Team Height
Name
Avery Bradley  Boston Celtics    6-2
Jae Crowder    Boston Celtics    6-6
John Holland   Boston Celtics    6-5
R.J. Hunter    Boston Celtics    6-5
Jonas Jerebko  Boston Celtics   6-10
...                       ...    ...
Shelvin Mack        Utah Jazz    6-3
Raul Neto           Utah Jazz    6-1
Tibor Pleiss        Utah Jazz    7-3
Jeff Withey         Utah Jazz    7-0
NaN                       NaN    NaN

[458 rows x 2 columns]

In [220]:
#single row
data.loc[["R.J. Hunter"],["Team"]]

                       Team
Name
R.J. Hunter  Boston Celtics

In [20]:
import pandas as pd
s = pd.Series([100, 250, 500, 150, 380])
df=pd.DataFrame(s)

In [21]:
def fun(num):
    
    if num<200:
        return "Low"

    elif num>= 200 and num<400:
        return "Normal"

    else:
        return "High"

In [23]:
new = s.apply(fun)

In [29]:
df = pd.DataFrame({
    'Math': [80, 40, 90],
    'Science': [70, 50, 60]
})
df.apply(lambda row:row.sum())

Math       210
Science    180
dtype: int64

In [31]:
df.sum(axis=1)

0    150
1     90
2    150
dtype: int64